javnson/gmp_pro/ctl/hardware_preset/mcu_board/stm32f405_motor_board.h
/**
 * @file stm32f405_motor_board.h
 * @brief SDPE hardware preset for STM32F405 Motor Control Board.
 * @details Generated by tools/SDPE_v2. Do not edit generated macros directly.
 */

#ifndef _MCU_BOARD_STM32F405_MOTOR_BOARD_H_
#define _MCU_BOARD_STM32F405_MOTOR_BOARD_H_

// User code after includes
// SDPE extension point: add after_includes code in the Entity Instance Code page if needed.

#ifdef __cplusplus
extern "C"
{
#endif

/**
 * @defgroup sdpe_stm32f405_motor_board STM32F405 Motor Control Board
 * @{
 */

// Identification
#define STM32F405_MOTOR_BOARD_ID "stm32f405_motor_board"
#define STM32F405_MOTOR_BOARD_SCHEMA "stm32_motor_control_board"
#define STM32F405_MOTOR_BOARD_NAME "STM32F405 Motor Control Board"

/*
 * Schema: STM32 motor-control board resource model for ADC, advanced PWM/HRTIM, encoder, UART-DMA Datalink, gate control and status indication.
 */

// Parameter macros
/**
 * @brief STM32 device name.
 */
#ifndef STM32F405_MOTOR_BOARD_CHIP
#define STM32F405_MOTOR_BOARD_CHIP "STM32F405RGTx"
#endif // STM32F405_MOTOR_BOARD_CHIP

/**
 * @brief Board or carrier identification.
 */
#ifndef STM32F405_MOTOR_BOARD_BOARD
#define STM32F405_MOTOR_BOARD_BOARD "Validated STM32F405 motor-control carrier"
#endif // STM32F405_MOTOR_BOARD_BOARD

/**
 * @brief STM32CubeMX project implementing the pin map.
 */
#ifndef STM32F405_MOTOR_BOARD_IOC_FILE
#define STM32F405_MOTOR_BOARD_IOC_FILE "ctl/suite/mcs_pmsm_nt/project/stm32f405/stm32f405.ioc"
#endif // STM32F405_MOTOR_BOARD_IOC_FILE

/**
 * @brief CPU/system clock in hertz.
 */
#ifndef STM32F405_MOTOR_BOARD_SYSTEM_CLOCK_HZ
#define STM32F405_MOTOR_BOARD_SYSTEM_CLOCK_HZ (168000000UL)
#endif // STM32F405_MOTOR_BOARD_SYSTEM_CLOCK_HZ

/**
 * @brief ADC handle used for motor-control injected conversions.
 */
#ifndef STM32F405_MOTOR_BOARD_ADC_HANDLE
#define STM32F405_MOTOR_BOARD_ADC_HANDLE (&hadc1)
#endif // STM32F405_MOTOR_BOARD_ADC_HANDLE

/**
 * @brief Quadrature encoder timer handle.
 */
#ifndef STM32F405_MOTOR_BOARD_ENCODER_TIMER_HANDLE
#define STM32F405_MOTOR_BOARD_ENCODER_TIMER_HANDLE (&htim3)
#endif // STM32F405_MOTOR_BOARD_ENCODER_TIMER_HANDLE

/**
 * @brief UART handle used by GMP Datalink.
 */
#ifndef STM32F405_MOTOR_BOARD_UART_HANDLE
#define STM32F405_MOTOR_BOARD_UART_HANDLE (&huart2)
#endif // STM32F405_MOTOR_BOARD_UART_HANDLE

/**
 * @brief UART peripheral instance used by callbacks.
 */
#ifndef STM32F405_MOTOR_BOARD_UART_INSTANCE
#define STM32F405_MOTOR_BOARD_UART_INSTANCE USART2
#endif // STM32F405_MOTOR_BOARD_UART_INSTANCE

/**
 * @brief Circular RX DMA handle used by GMP Datalink.
 */
#ifndef STM32F405_MOTOR_BOARD_UART_RX_DMA_HANDLE
#define STM32F405_MOTOR_BOARD_UART_RX_DMA_HANDLE (&hdma_usart2_rx)
#endif // STM32F405_MOTOR_BOARD_UART_RX_DMA_HANDLE

/**
 * @brief Gate-driver enable GPIO port.
 */
#ifndef STM32F405_MOTOR_BOARD_GATE_ENABLE_PORT
#define STM32F405_MOTOR_BOARD_GATE_ENABLE_PORT PWM_DISABLE_GPIO_Port
#endif // STM32F405_MOTOR_BOARD_GATE_ENABLE_PORT

/**
 * @brief Gate-driver enable GPIO pin.
 */
#ifndef STM32F405_MOTOR_BOARD_GATE_ENABLE_PIN
#define STM32F405_MOTOR_BOARD_GATE_ENABLE_PIN PWM_DISABLE_Pin
#endif // STM32F405_MOTOR_BOARD_GATE_ENABLE_PIN

/**
 * @brief Status LED GPIO port.
 */
#ifndef STM32F405_MOTOR_BOARD_STATUS_LED_PORT
#define STM32F405_MOTOR_BOARD_STATUS_LED_PORT GPIOC
#endif // STM32F405_MOTOR_BOARD_STATUS_LED_PORT

/**
 * @brief Status LED GPIO pin.
 */
#ifndef STM32F405_MOTOR_BOARD_STATUS_LED_PIN
#define STM32F405_MOTOR_BOARD_STATUS_LED_PIN GPIO_PIN_13
#endif // STM32F405_MOTOR_BOARD_STATUS_LED_PIN

// User code before footer
// SDPE extension point: add before_footer code in the Entity Instance Code page if needed.

/** @} */

#ifdef __cplusplus
}
#endif

#endif // _MCU_BOARD_STM32F405_MOTOR_BOARD_H_
